"""
Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка. В его конструкторе
инициализировать параметр, соответствующий количеству клеток (целое число). В классе должны быть реализованы методы
перегрузки арифметических операторов: сложение (__add__()), вычитание (__sub__()), умножение (__mul__()),
деление (__truediv__()).Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение,
умножение и обычное (не целочисленное) деление клеток, соответственно. В методе деления должно осуществляться
округление значения до целого числа.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух клеток больше
нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение количества ячеек этих
двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества
ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order() вернет строку:
*****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод make_order() вернет строку:
*****\n*****\n*****.
"""

class Cell:
    def __init__(self, value):
        self.value = int(value)

    def __add__(self, other):
        return  self.value + other.value

    def __sub__(self, other):
        sub = self.value - other.value
        if sub > 0:
            return sub
        else:
            return f'клетка исчезла'

    def __truediv__(self, other):
        return self.value // other.value

    def __mul__(self, other):
        return self.value * other.value

    def make_order(self, row):
        my_str = ''
        for i in range(int(self.value / row)):
            my_str += '*' * row + '\n'
        my_str += '*' * (self.value % row)
        return my_str

cell_1 = Cell(32)
cell_2 = Cell(32)
row = 10
print(f'Сложение клеток. Итоговая клетка имеет размер:\t{cell_1 + cell_2}')
print(f'Вычитание клеток. Итоговая клетка имеет размер:\t{cell_1 - cell_2}')
print(f'Деление клеток. Итоговая клетка имеет размер:\t{cell_1 / cell_2}')
print(f'Умножение клеток. Итоговая клетка имеет размер:\t{cell_1 * cell_2}')
print(f'Первая клетка по {row} в ряд:\n{cell_1.make_order(row)}')
print(f'Вторая клетка по {row} в ряд:\n{cell_2.make_order(row)}')